## Plan Result (prod-prod)




<pre><code>Plan: 7 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.poc-secure-access.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.poc-secure-access.azurerm_dns_ns_record.this[&#34;@&#34;]
  * module.poc-secure-access.azurerm_dns_zone.zone
  * module.poc-secure-access.azurerm_role_assignment.dnszonecontributer
  * module.secure-access.azurerm_dns_a_record.this[&#34;poc&#34;]
  * module.secure-access.azurerm_dns_zone.zone
  * module.secure-access.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.poc-secure-access.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = [
          + "4.234.33.219",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "poc.secureaccess.justice.gov.uk"
    }

  # module.poc-secure-access.azurerm_dns_ns_record.this["@"] will be created
  + resource "azurerm_dns_ns_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + records             = [
          + "ns1-04.azure-dns.com.",
          + "ns2-04.azure-dns.net.",
          + "ns3-04.azure-dns.org.",
          + "ns4-04.azure-dns.info.",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "poc.secureaccess.justice.gov.uk"
    }

  # module.poc-secure-access.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "poc.secureaccess.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.poc-secure-access.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.secure-access.azurerm_dns_a_record.this["poc"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "poc"
      + records             = [
          + "23.54.163.87",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "secureaccess.justice.gov.uk"
    }

  # module.secure-access.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "secureaccess.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.secure-access.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.secure-access.azurerm_dns_zone.zone has been deleted
  - resource "azurerm_dns_zone" "zone" {
      - id                        = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnszones/secureaccess.justice.gov.uk" -> null
        name                      = "secureaccess.justice.gov.uk"
        tags                      = {}
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1045,"Program":"tfcmt","SHA1":"","Target":"prod-prod","Vars":{}} -->